[
{"review_id": "2579715523", "rating": 4, "title": "More updates to come", "review_date": "2018-05-22T05:13:01Z", "user_name": "Samsoumitunes", "review": "I am sure this app will be like a fundamental tool for our daily life (comparable to daily steps or weather). I am also sure the improvements and practical features will be updated soon to make it perfect. I am sending regularly when needed my feedback. Since it’s a new app we have to be part of it from the beginning.", "response_id": 5175794, "dev_response": "Thank you for your comment! We love getting your feedback, we know we still have a lot to improve!", "response_date": "2018-09-22T18:48:20Z"},
{"review_id": "2714285310", "rating": 3, "title": "Is not tracking my symptoms but is still helpful.", "review_date": "2018-06-17T22:01:32Z", "user_name": "p-money7", "review": "I want to love this app, but I’ve been logging my symptoms for 3 weeks and it has yet to show me any statistics or triggers. The statistics pages are blank and under triggers it says I haven’t logged enough info yet. I do appreciate the alerts when air quality changes - very helpful for someone who loves to spend time outdoors but has terrible allergies and asthma. I just wish it actually tracked my symptoms!", "response_id": 3893613, "dev_response": "Thank you for your feedback! You need to log your symptoms at least 6 times for the app to be able to understand your triggers. Let us know when the feature is unlocked!", "response_date": "2018-06-19T11:17:10Z"},
{"review_id": "3650933831", "rating": 4, "title": "So far, so good!", "review_date": "2019-01-15T00:44:27Z", "user_name": "egretsrus", "review": "How can I delete the daily notifications? They’re really piling up. Also, on bad pollution days the advice given on your app is to take a bus or other public transport. Bus fumes aren’t known to be good for asthma 😳", "response_id": 6848026, "dev_response": "Thanks for your comment, buses and tubes are certainly faster than cars. Sitting idle in traffic can be very harmful for your health and it is inefficient. While in some countries we can appreciate public transport isn’t great, if everyone used it the carbon emissions would be reduced considerably. One bus can replace up to 30 cars!\n\nIn order to delete the notifications just swipe left and tap delete.", "response_date": "2019-01-15T14:14:11Z"},
{"review_id": "5201671987", "rating": 1, "title": "FORCED TO CREATE AN ACCOUNT", "review_date": "2019-11-27T02:36:05Z", "user_name": "Topbridge", "review": "I HATE HATE H A T E apps that force you to sign up and create an account. As soon as you open the app if shows up and you can’t do or see anything else. I’m so sick and frustrated of all that do this. You think someone having a serious health problem ha time to do all your stupid steps? The priority here is access to crucial information. How IGNORANT of the developers to put up a stupid sign up first. GET RID OF IT. YOU GIVE PEOPLE THE OPTION AND IF THEY DONT WANT TO, THEN THAT IS THEIR DECISION. You don’t force that choice on anyone. PEOPLE HAVING MEDICAL EMERGENCIES AND ALL YOU CARE ABOUT IS AN EXTRA SUBSCRIBER FOR YOU TO SPAM."},
{"review_id": "3174901787", "rating": 3, "title": "One day, this may become a great app.", "review_date": "2018-09-10T14:00:07Z", "user_name": "APColliflower", "review": "I wish that the app tracked my area.  I live in Ohio and there is no Ohio city to add.  I have no idea from where the pollen reports are coming.  \n- The design of the app, ease of use and the way one reports symptoms is very intuitive and easy to use.  I believe it to be at the top of the list of quality allergy/asthma trigger apps.  However, one needs to know what’s going on in their particular area.", "response_id": 6390681, "dev_response": "Hello, thank you very much for your feedback and for your kind words concerning the design. We are currently growing our network of allergen trackers in the US by placing our sensors in strategic locations. Which city would you like to see on the app?", "response_date": "2018-12-14T16:54:38Z"},
{"review_id": "3174901790", "rating": 3, "title": "One day, this may become a great app.", "review_date": "2018-09-10T14:00:07Z", "user_name": "APColliflower", "review": "I wish that the app tracked my area.  I live in Ohio and there is no Ohio city to add.  I have no idea from where the pollen reports are coming.  \n- The design of the app, ease of use and the way one reports symptoms is very intuitive and easy to use.  I believe it to be at the top of the list of quality allergy/asthma trigger apps.  However, one needs to know what’s going on in their particular area."},
{"review_id": "3174901765", "rating": 3, "title": "One day, this may become a great app.", "review_date": "2018-09-10T14:00:07Z", "user_name": "APColliflower", "review": "I wish that the app tracked my area.  I live in Ohio and there is no Ohio city to add.  I have no idea from where the pollen reports are coming.  \n- The design of the app, ease of use and the way one reports symptoms is very intuitive and easy to use.  I believe it to be at the top of the list of quality allergy/asthma trigger apps.  However, one needs to know what’s going on in their particular area.", "response_id": 5175763, "dev_response": "Thank you very much for your feedback, we're very happy that you found the app easy to use! We've just added Columbus to our network, you can now add it to your city list and start logging your symptoms.", "response_date": "2018-09-22T18:39:24Z"},
{"review_id": "1775601497", "rating": 5, "title": "A great idea that's well implemented", "review_date": "2017-09-05T19:56:20Z", "user_name": "David Haddad", "review": "If yiu believe the adage that you can only improve what you measure and if you care about improving your asthma or allergies then this app which lets you improve your health by tracking air conditions and your own symptoms is for you."},
{"review_id": "4125441347", "rating": 5, "title": "Great way to keep track of my allergies", "review_date": "2019-05-09T20:56:28Z", "user_name": "Cylb", "review": "Love the app, it really packs lots of features from environmental info to symptom logging. You can also use it to get weather, pollen and pollution forecasts!", "response_id": 8699613, "dev_response": "Thank you very much for your feedback!", "response_date": "2019-05-16T09:04:59Z"},
{"review_id": "3230083266", "rating": 2, "title": "Too many problems", "review_date": "2018-09-25T23:43:23Z", "user_name": "Kevin_in_cs", "review": "Have had too many glitchy problems getting info entered or retained by the app. Sometimes not enough feedback or response to know what I’m entering is registering. More instructions are needed, with specifics on how or when info is entered and whether it’s being retained.", "response_id": 6390653, "dev_response": "Hello Kevin, Thank you for your feedback. Thanks to you, we are now improving our feedback mechanisms when the user inputs information. We'll be releasing a new version soon that will hopefully sort this out.", "response_date": "2018-12-14T16:52:46Z"},
{"review_id": "2609528181", "rating": 5, "title": "Finally an app that can help me manage my allergies!", "review_date": "2018-05-28T21:38:56Z", "user_name": "Richard jolio", "review": "Great product, very helpful to anybody that is trying yo manage their allergies (mine are cat dander and some pollen). Keep up the good work", "response_id": 5175778, "dev_response": "Thank you for your feedback Richard! Don't forget to log your symptoms to understand which types of pollen you react to!", "response_date": "2018-09-22T18:45:09Z"},
{"review_id": "2612985502", "rating": 5, "title": "Awesome App!", "review_date": "2018-05-29T15:31:23Z", "user_name": "Momma Berta", "review": "What an incredible app!!! Not only is it easy to use and nice looking but it’s totally on point! Thrilled with this new technology 💥", "response_id": 5175773, "dev_response": "Thank you so much for your kind feedback!", "response_date": "2018-09-22T18:43:38Z"},
{"review_id": "4051165416", "rating": 2, "title": "Needs more locations", "review_date": "2019-04-23T18:49:58Z", "user_name": "Wildwoodflwr", "review": "App seems like it would be great but is greatly lacking in area information. The closest city to me is 3 hours away in another state. The pollen that far north doesn’t affect me as much as the pollen coming up from the south.", "response_id": 8434449, "dev_response": "Hello and thank you for your feedback. We are working very hard to cover all major cities but extending our network of sensors takes time! Could you please let us know in the feedback section of the app (settings) which city you'd be interested in? We'll make sure to add it to our list :)", "response_date": "2019-04-29T16:06:38Z"},
{"review_id": "5580665537", "rating": 1, "title": "App doesn’t find my location, Florida, U.S.", "review_date": "2020-02-26T01:43:15Z", "user_name": "AmandaElizabeth520", "review": "Maybe I’m missing something? But the app doesn’t find my current location. Instead, my options are from a select list of cities around the world but none of them are my current hometown or even close to me.", "response_id": 14655143, "dev_response": "Hello, if the app is not finding your current location it is most probably that you have disabled the location service when you first downloaded the app. To fix this issue, head to the phone settings, scroll down to Sensio Air and check if location is enabled. It needs to be set on \"While using the App\". We hope this was helpful, please reconsider our rating if you are satisfied. ", "response_date": "2020-04-14T10:07:42Z"},
{"review_id": "3630990329", "rating": 5, "title": "You can write your symptoms", "review_date": "2019-01-09T18:44:04Z", "user_name": "professoor scripts", "review": "Sets it apart from everyone", "response_id": 6766230, "dev_response": "Hello, thank you for your 5 Stars Rating.", "response_date": "2019-01-10T09:13:29Z"},
{"review_id": "5898579801", "rating": 2, "title": "Location", "review_date": "2020-05-03T18:40:05Z", "user_name": "Jojo56789", "review": "I live in Indiana, United States. There are only locations for big cities. So since there is no way to set location to my city I have no idea what the allergen and pollution rating is therefore doesn’t really help me any."},
{"review_id": "1795231875", "rating": 5, "title": "Great App", "review_date": "2017-09-17T22:01:52Z", "user_name": "Tiger701", "review": "Great way to monitor air quality !", "response_id": 5175800, "dev_response": "Thank you for your feedback!", "response_date": "2018-09-22T18:49:32Z"},
{"review_id": "4254006354", "rating": 1, "title": "Location", "review_date": "2019-06-02T22:07:47Z", "user_name": "Jsjdbeosnfogneoap", "review": "This app makes no sense if you are unable to get the air quality information for your exact location. Why won’t it use my current location?"},
{"review_id": "3804188241", "rating": 2, "title": "Missing Cities for Allergen Alerts", "review_date": "2019-02-23T09:44:29Z", "user_name": "Allergy Tracker", "review": "The locations in the app do not contain a lot of the major cities or areas, and there is no way to add cities that are not in the lookup", "response_id": 8446282, "dev_response": "Hello, we are currently in the process of adding new locations, and we noticed you had required this earlier could you please let me know where you’re based\n.\nAlso could we please ask you to reconsider your rating on the app store once this is resolved. \n\nThank you, \nKate Mares, Customer Management", "response_date": "2019-04-30T09:27:54Z"},
{"review_id": "4825718335", "rating": 2, "title": "Poor UI", "review_date": "2019-09-23T00:05:09Z", "user_name": "mw212", "review": "Font is way too small and no apparent way to adjust."},
{"review_id": "5992518406", "rating": 3, "title": "Poor Alaska", "review_date": "2020-05-25T15:49:12Z", "user_name": "TheOneThatMatters", "review": "No Anchorage?"},
{"review_id": "3221852234", "rating": 1, "title": "Not In My Area of Missouri", "review_date": "2018-09-23T15:55:51Z", "user_name": "Mason Newman", "review": "I would love to be able to use this app, however it is not in my city so I can’t.", "response_id": 6390662, "dev_response": "Hello Mason, thank you for your feedback. We are currently growing our network of allergen trackers in the US. Which city would you like to access? We'll make sure to add it in the next version.", "response_date": "2018-12-14T16:53:23Z"},
{"review_id": "3033171034", "rating": 1, "title": "Not in my area", "review_date": "2018-08-08T02:04:22Z", "user_name": "allowstatecheckbeforedownload", "review": "Would love this app if it even covered part of Nebraska. Not even one city in Nebraska😜", "response_id": 4873784, "dev_response": "Hello thanks for your feedback, indeed we do not have your area covered yet but we are working on it. ", "response_date": "2018-08-30T12:19:11Z"},
{"review_id": "2592144865", "rating": 5, "title": "Brilliant", "review_date": "2018-05-25T03:03:39Z", "user_name": "Ahmad muhaisen", "review": "This is a awesome!"},
{"review_id": "5653413703", "rating": 2, "title": "High Monthly Fee", "review_date": "2020-03-13T06:23:06Z", "user_name": "MezzoMH", "review": "It’s nice to see daily allergy reports, but if you’re looking to track your symptoms and learn about possible causes, it will cost you $19.99/month.", "response_id": 14656638, "dev_response": "Hello, thank you for your feedback. It is currently free and we are considering the cost on a yearly basis rather than monthly. We hope you welcome this change and also consider reviewing your rating :) ", "response_date": "2020-04-14T11:07:28Z"},
{"review_id": "4678160765", "rating": 1, "title": "Not ready for prime time - high report cost - glitchy", "review_date": "2019-08-26T17:33:29Z", "user_name": "HollyYarbrough", "review": "$19.99 subscription fee to get a report, hardly any US cities represented for weather/pollen triggers. Very glitchy, had to keep closing and reopening to see other screens. Very good idea in theory and would be worth the fee if it allowed me to track my triggers to figure things out....but unusable as-is. Deleting..."}
]