[
{"review_id": "1977613148", "rating": 5, "title": "Everyone should be using this APP", "review_date": "2017-12-07T14:41:53Z", "user_name": "KC3M", "review": "I've been using Plume for almost a year and have introduced it to many people who were not aware of how important it is to monitor AQI especially when you have young children. My children also use this App on their own now. \nI love the new improvements and the ease of use. As an outdoor athlete it has helped me tremendously in managing the quality and amount of time I spend outside over the last year which in turn has impacted my health and the health of my family. I highly recommend."},
{"review_id": "2030111284", "rating": 4, "title": "Look no further!", "review_date": "2017-12-26T22:04:10Z", "user_name": "Jacques Matineau", "review": "This app does what is says and quite well. \n\nI’ve used it in Chinese, Japanese and English and the functionality was consistent across all three languages. \n\nThe limitations I could see were;\n\n(1) there was no way to modify the city list; you have to first delete the cities and re-enter them in the order you prefer. \n\n(2) when you delete a city, the last city in your list is “promoted” to top of the list.  That makes it even harder to re-sequence your list...\n\nand, \n\n(3) there is no way to select which city appears in the widget, so if you want to see your city at a glance (in the widget) it has to be at the top of your cities.  Otherwise you have to fiddle around with the list, back to (1) and (2).\n\nFinally (4), there is no way to add air quality tracking stations that may not otherwise be listed in the city list. \n\nTruth be said, these are really minor points that don’t take away from the functionality and useful information, at all. \n\nGreat app. Recommend it if you’re tracking air quality in your area.", "response_id": 2145616, "dev_response": "Many thanks for your review and detailed feedback! I've passed on your concerns to our development team to take into account for future updates. Your feedback is incredibly valuable to us and we hope to address your concerns in the near future. If you have any further suggestions don't hesitate to get in touch with us at support@plumelabs.com. Thanks again and all the best! Joe for Plume.", "response_date": "2017-12-27T16:33:02Z"},
{"review_id": "3969994802", "rating": 5, "title": "So far so good!", "review_date": "2019-04-04T21:48:24Z", "user_name": "littleapples", "review": "Just learned about this and got it on the basis of the reviews. I intend to go with the Flow as well. I cannot judge the accuracy but it seems to offer so much more than the apps I had been using, and I am very susceptible to pollution-related health issues. I do have the luxury of choosing where I get my exercise and I expect this to help me decide where to spend time. If it helps me I will also be sharing information about this product with elderly neighbors as respiratory issues loom large in this part of the world."},
{"review_id": "2163867122", "rating": 5, "title": "Great if you have asthma", "review_date": "2018-02-03T23:25:26Z", "user_name": "Much Kuler", "review": "I use this daily so I know the best time to go out for exercise. You can set up morning and evening notification updates. Love that it automatically locates the city you are in which is great since I travel a lot. \n\nThe developer is very timely in responding to requests. Would like to see option for am/pm in addition to the 24 hour clock. \n\nUnder the Settings tab, there is an offer for a hand held air quality monitor for those who are interested in taking their own readings.", "response_id": 2469302, "dev_response": "Thank you very much for your suggestion. We value all feedback from our users here at Plume, and I have logged your request as part of our ongoing development process. We are constantly working to make our global forecasting more in depth, but as you can imagine it is an incredibly complex process requiring extensive resources. Little by little, however, we are working to make the air you breathe more transparent. If you have any other feedback or requests, don't hesitate to drop us an email at support@plumelabs.com! Thanks again, Joe for Plume.", "response_date": "2018-02-01T14:29:16Z"},
{"review_id": "3677839043", "rating": 5, "title": "Phenomenal and Life Saving", "review_date": "2019-01-21T14:37:57Z", "user_name": "MDTannen", "review": "Plume worked so well to protect my family members that I purchased the economical portable Flow device to track air quality. We’ve used the software and the portable device for a year in many cities in the USA. Plume and Flow apps are very easy to use and are extremely accurate and effective. We highly recommend the software and the portable device to others around the world."},
{"review_id": "1541178067", "rating": 4, "title": "Effective, clear, useful.", "review_date": "2017-02-10T06:21:36Z", "user_name": "jamexcel", "review": "The data visualization/interface is intuitive, effective and powerful. I have not analyzed the accuracy of the data, and I am sure that in a large city such as Toulouse it might be inaccurate depending on where you are, but as far as using it as a general indicator as when to plan our outings with our infant, it's useful. I wish there were more data samplings that would allow the app to differentiate pollution levels between a secluded park and a major motorway. If this could tap into amateur data readings, that would be ideal!"},
{"review_id": "1821382284", "rating": 4, "title": "One word VOG", "review_date": "2017-10-01T20:38:04Z", "user_name": "VeryMissBerrie", "review": "I like how this app works, it’s practical and it looks for a lot of particles in the air that could cause allergy sufferers to have an episode. Problems I gave it a 4 Star is Hawaii has something unique called vog. I noticed it did saw it could measure this. But I saw on the app that today October 1st we had clean air, when I looked outside my apartment window you can’t even see the ocean or mountains because the haze was so thick. Figured maybe you could people in Hawaii out :) other than that when I travel it helps a lot."},
{"review_id": "3100738108", "rating": 5, "title": "Breathe Easy and Clear", "review_date": "2018-08-22T21:53:17Z", "user_name": "Seeking Language Genius Status", "review": "Plume is by far the absolute best monitor and reporter of air quality. Plume allows me to be proactive.  Plume shows the air quality so that I can make sure that I am located by an air filter when the air quality index is high and this shows why my asthma is bad. No other app does this. Other apps show pollen and other pollutants but not what plume shows you.  Breathe easy and clear with Plume.  You need Plume now!"},
{"review_id": "3951711532", "rating": 5, "title": "Awesome", "review_date": "2019-03-31T14:32:10Z", "user_name": "LeChatParle", "review": "Pollution data shouldn’t stop you from exercising. Studies have shown that even in cities as polluted as many Chinese or Indian cities, up to 30 minutes of exercise is still beneficial. In western cities with lower pollution levels, it would often take 15-20 hours of constant exposure prior to the exercise outside being bad for your health. For people in the west, it’s never a bad time to exercise."},
{"review_id": "5164461517", "rating": 3, "title": "Almost always out of line with other info", "review_date": "2019-11-18T14:16:43Z", "user_name": "BadAp57", "review": "It’s hard to understand this app, but the general message is always worse than everything else I see. One time it was green and the AQI was good (low). Plume had a frown and said high. Things are bad enough without exaggerating. Since it’s so different from other apps it would be nice to have a key.\n\nIt is cute, but the information I’m looking for is pretty simple and as far as I can tell it’s inaccurate here."},
{"review_id": "1711850968", "rating": 5, "title": "Top Notch App!", "review_date": "2017-08-04T01:37:23Z", "user_name": "worldwyn", "review": "This is really a great app if you or a loved one has respiratory issues or you are just interested in tracking air pollution.  There are many features and a lot of ways to look at various pollutants in many major international population areas. I love the various history graphs showing short, medium, and long range views."},
{"review_id": "1440333084", "rating": 4, "title": "Great tool-", "review_date": "2016-08-28T00:16:47Z", "user_name": "Kd278", "review": "This app provides wonderful information on air quality. This is especially helpful because I have a small daughter and want to protect her as much as possible. However, we live in a smaller city and the app only update every few hours, so it is not always reliable in real-time. It's great for a historic view of air quality. To see the typical times air quality is bad/good."},
{"review_id": "4149239084", "rating": 5, "title": "Great help!", "review_date": "2019-05-14T14:42:20Z", "user_name": "xdesgh", "review": "Having been recently diagnosed with COPD this app is a lifesaver for me. I am an active 68-year-old who still works 5 miles a day and a Zumba and weightlifting three days a week. Still, who knew? Diagnosed with COPD. I’m aggressively tracking all things that created this monstrous disease in May. This app is where I start every morning"},
{"review_id": "3684132173", "rating": 5, "title": "Phone app works great, just not the watch", "review_date": "2019-01-23T06:35:01Z", "user_name": "SixCrazyPants", "review": "The iPhone app does well with providing detailed info.  I love the GUI and the ability to see other parts of the world.  However the apple watch app is completely useless, as all it does is tell me to log in, when I already am."},
{"review_id": "3214240298", "rating": 1, "title": "Inaccurate information", "review_date": "2018-09-21T16:30:46Z", "user_name": "harms4eva", "review": "I live in LA and every time Ilook at the Plume app and check humidity, it is way different than the humidity my weather app boasts, and I have trouble believing the Plume App, because it says it is 89%-96% humidity here and I don’t believe that is the humidity.  The temperature is also usually different.  If the temperature and humidity are incorrect, how am I to believe the PAQI measurements?  I cannot find a way to contact Plume, even clicking on App Support in the App Store just links me to the Plume Labs website, which has no phone or e-mail available."},
{"review_id": "4340504612", "rating": 5, "title": "A very useful and accurate indicator", "review_date": "2019-06-19T22:53:01Z", "user_name": "Mklnaz", "review": "I use Plume to determine the air quality each day as I plan my outdoor activities.  I have asthma and Plume has allowed me to avoid poor air quality conditions.  My asthma doctor was very impressed with Plume and plans to alert all of his patients as to its usefulness!   Thank you Plume!"},
{"review_id": "5134271539", "rating": 5, "title": "Like Plume！", "review_date": "2019-11-14T00:57:25Z", "user_name": "sheayone", "review": "Elegant UI and easy to use. Could you make the widget customizable? The default location of widget is current location, but it always uses location api to get the current location, kind of not reasonable and power wasted."},
{"review_id": "2267645727", "rating": 3, "title": "Lots of potential but needs work", "review_date": "2018-03-03T20:57:37Z", "user_name": "a hill", "review": "Lots of potential and great for people like us who live in 3rd world countries and are always worried about dust or factory or car pollution.\n\nThe widget is a nice touch (*Update* the widget is erratic (‘unable to load’ - unless you click it, it needs work).\n\nThe app needs a better UI with colours signifying good to worse pollution ratio (green to yellow to orange to red to purple - for example)", "response_id": 2631422, "dev_response": "Hi there, thanks so much for your review! We take all feedback seriously here at Plume, and I've logged your suggestion to pass on to the development team. We are constantly striving to improve the in-app user experience. If you have any other suggestions please do send us an email at support@plumelabs.com and a member of our team will be in touch to discuss them. Thanks again! Joe for Plume.", "response_date": "2018-02-20T18:10:01Z"},
{"review_id": "5790085938", "rating": 2, "title": "Dubious update", "review_date": "2020-04-10T09:02:32Z", "user_name": "Martinmusic", "review": "You lost some of the best parts of the app. Being able to squeeze the charts to see however longer timeline was great. Now there is no referenced point for the bar charts. Also data seems to have been changed. It no longer coincides with my hand held air quality monitor I test our neighborhood with which previously matched your data. No longer. Threw out the baby with the bath water.", "response_id": 14890423, "dev_response": "Hi,\n\nThank you very much for your feedback. Sorry you're having a less than ideal experience so far. We'd really appreciate hearing more so we can do better! Could you please contact us at antoine.simon@plumelabs.com to share your feedback and comments? \nI would be thrilled to discuss with you about the app so you could improve it to match your expectations.\n\nBest regards, Antoine Simon, Product Manager.", "response_date": "2020-04-24T12:38:55Z"},
{"review_id": "5878462594", "rating": 1, "title": "Almost always reports having bad air quality", "review_date": "2020-04-29T06:55:58Z", "user_name": "storms002", "review": "I have been using this app for a month for checking the air quality. However when I go to check the air quality where I live, I usually get a high amount of pollution reading. I compared the readings from the my local news channel and they report good to moderate air quality. Not sure why the reading is so off, but as it stands now I cannot recommend using this app."},
{"review_id": "4250155541", "rating": 5, "title": "Extremely excited for the UI", "review_date": "2019-06-02T07:24:33Z", "user_name": "Minhbeooo", "review": "- UI Clear but still informative enough for me to know what to do\n- no ads interrupt while i’m using the app (10/10) for this)\n=> definitely share for friends"},
{"review_id": "3207310292", "rating": 4, "title": "Lots of great information", "review_date": "2018-09-19T18:03:32Z", "user_name": "current key bell", "review": "Intelligent design giving a lot of information combined together in this app. \nAlmost perfect but I wish it could be a little faster to display data and have the world map default to your current location instead of the EU."},
{"review_id": "1674688065", "rating": 5, "title": "Wonderful app especially for travelers", "review_date": "2017-07-09T01:45:24Z", "user_name": "LuGood531", "review": "This app gives real time air quality data for areas where I live and travel. Pollutants are identified for each, which is most helpful."},
{"review_id": "5858058027", "rating": 4, "title": "New look, but something about street view", "review_date": "2020-04-24T16:03:54Z", "user_name": "gizmo9879", "review": "I am fine with the new design, even though I personally like the old design. There is no more crashes but I cant zoom into the New York street view, but for some reason I can for Philadelphia", "response_id": 14889962, "dev_response": "Hi,\n\nThank you very much for your comment and the 4-star rating. Please feel free to contact us at airreport@plumelabs.com if you would like to share with us a more detailed feedback.\n\nAll the best, Antoine Simon, Product Manager", "response_date": "2020-04-24T12:20:46Z"},
{"review_id": "3451768942", "rating": 5, "title": "This is the one", "review_date": "2018-11-23T18:34:48Z", "user_name": "LMRAT", "review": "Best air quality app I’ve tried. Includes cites around the globe that other apps don’t bother with. No annoying “features” or pushes to buy things you don’t need. Perfect."},
{"review_id": "3459984411", "rating": 1, "title": "UNINSTALLING", "review_date": "2018-11-25T19:47:29Z", "user_name": "kenslovee", "review": "This app is a croc of sh** it kept saying the air quality was “high” and then it said “very high” so I look on 4 other websites and the air quality is actually “good” and “fair” in the green . This app is very unreliable very inaccurate and therefore useless. I’m uninstalling! Thanks for the FAKE news I kept my baby indoors the whole day because of your lies on this app claiming the air was “extremely high” wow ! Thank you for ruining my day uninstall this app is very INACCURATE AND WRONG"},
{"review_id": "1665556601", "rating": 5, "title": "Awesome app!!", "review_date": "2017-07-02T03:04:12Z", "user_name": "Jenjoon", "review": "This app is SO useful for real-time info on air quality! This is such an important issue to address and this app helps provide the information you need to be healthy!!"},
{"review_id": "3105625660", "rating": 2, "title": "Doesn't provide accurate info.", "review_date": "2018-08-24T00:20:47Z", "user_name": "Lmonkeyee", "review": "The interface is nice and easy to use, but the app doesn't show a standard Air Quality Index (AQI), but rather it's own made-up \"Plume Index\" that doesn't seem to correspond to anything. When emergency AQI warnings we're being issued in my city for unhealthy air, this app still said it was only \"moderate.\" So you can't trust the info you're getting."},
{"review_id": "2672664918", "rating": 3, "title": "Locations are off", "review_date": "2018-06-10T18:21:25Z", "user_name": "unevagess", "review": "I live on Hawaii’s Big Island, yes we have this volcanic eruption. The detailed locations are having their different ratings but some are named the same, even though far apart. \nAlso was not able to delete some locations. \nOtherwise seems to be working"},
{"review_id": "3560686334", "rating": 1, "title": "Do not trust this app!", "review_date": "2018-12-22T20:18:05Z", "user_name": "Mst1234", "review": "I used it while traveling in Eastern Europe which is notorious for air pollution especially during the winter. This app said the aqi in Sofia was the same level as New York which is a joke. The data also did not agree with several other more reliable sources which I checked online. Because of the app, I went outside when the pm 2.5 aqi was in hazardous, near 400 territory. It’s very dangerous to trust this app!"},
{"review_id": "4132132282", "rating": 5, "title": "Handy for Asthma", "review_date": "2019-05-11T06:13:51Z", "user_name": "denninrl", "review": "I just started using this app, but I have found it very helpful! As a newly diagnosed asthmatic I am able to use this app to help plan activities so I can fully enjoy them!"},
{"review_id": "2021188218", "rating": 5, "title": "Know what you breathe...", "review_date": "2017-12-23T18:40:58Z", "user_name": "STOP'n SHOP™", "review": "The power of information in crucial aspects like clean air is the most valuable data you can have to keep your health!"},
{"review_id": "1539961753", "rating": 3, "title": "Good but not accurate in large city", "review_date": "2017-02-08T13:12:17Z", "user_name": "Fyrisle", "review": "The air varies from neighborhood to neighborhood in NYC so Plume is not very useful when it gives a single reading for the entire city. I do see it as useful when I visit my parents in the suburbs though as they live in an area that is that is geographically smaller."},
{"review_id": "5057489563", "rating": 1, "title": "Far from accurate", "review_date": "2019-10-31T21:19:17Z", "user_name": "Aplefail", "review": "As of today this app is saying it’s almost 200 AQI when the skies are clear, blue and see as far as the eye can see. Other AQI apps are the same across the board and are low which is accurate. I wouldn’t take the information on this app serious as you’ll prob want to stay inside every day. Hahaha! Save yourself some time and don’t download this app."},
{"review_id": "5860156783", "rating": 5, "title": "Crashes", "review_date": "2020-04-25T03:09:18Z", "user_name": "rivrrat", "review": "Update: Version 3.0.1 seems to have fixed the issues!\nGreat app!\n\nNew update pretty much broke the app. Crashes all the time.", "response_id": 14890549, "dev_response": "Hi,\n\nThank you very much for your feedback. Sorry for your less than ideal experience with the new app. Please update the latest version v3.0.1. It should solve most of the problems you were facing with the v3.0.0.\n\nPlease feel free to send me your feedback and comments at antoine.simon@plumelabs.com. I would be thrilled to discuss with you about our new app.\n\nAll the best, Antoine Simon, Product Manager.", "response_date": "2020-04-24T12:45:36Z"},
{"review_id": "3085151473", "rating": 5, "title": "This App Has It All", "review_date": "2018-08-19T07:07:57Z", "user_name": "xANAx", "review": "Intuitive layout with excellent features and multiple customizable options. Five stars!"},
{"review_id": "3097336819", "rating": 2, "title": "Unsure of accuracy", "review_date": "2018-08-22T02:31:49Z", "user_name": "Jeff-707", "review": "Initially, i thought this app was great.  Very easy to use.  But the more and more I used, the more I was concerned about it’s accuracy.\n\nI have found multiple instances where the trend visuals do not align with the AQI number itself.\n\nAt this point I’m not sure which is more accurate, number or trend. Or worse, both.", "response_id": 4794437, "dev_response": "Hi there! Thanks for your review, I'd be grateful if you could reach out to support@plumelabs.com with more information about the issues you've described. It may be due to the AQI units selected in your app. Please note that the trend curve is always displaying results in our Plume AQI, even if a different AQI is selected for the numbers in the app. Don't hesitate to get in touch if you require further information. Best, Joe for Plume.", "response_date": "2018-08-24T10:27:35Z"},
{"review_id": "3757684902", "rating": 5, "title": "Floridian who loves it", "review_date": "2019-02-11T12:13:42Z", "user_name": "StoniBlue", "review": "Given this state so far behind supplying accurate data find app extremely helpful esp with alerts re sudden really bad air."},
{"review_id": "5543359500", "rating": 5, "title": "Depend upon it", "review_date": "2020-02-17T12:15:35Z", "user_name": "Miss A Step", "review": "I use this app all day long. Living in a  highly polluted environment where hiking is the past time, it’s hugely important I stay on top of the index."},
{"review_id": "3952518986", "rating": 2, "title": "world air map doesn't appear", "review_date": "2019-03-31T18:13:17Z", "user_name": "BA customer", "review": "I liked the App when I installed it few months back and I especially liked the world air quality map. Sadly , the map stopped showing last time I checked. I reinstalled the app but still the map stopped showing."},
{"review_id": "1973897455", "rating": 5, "title": "Works grate around the world!", "review_date": "2017-12-06T03:25:28Z", "user_name": "d_b83", "review": "After the last update it started working in Mexico, excellent product!", "response_id": 1927836, "dev_response": "Hi there! Thanks so much for your review. We've just released a major update to the app providing air quality forecasting for every city in Mexico, in fact, every city on Earth! I hope you enjoy downloading the update and having a look around. All best wishes, Joe for Plume.", "response_date": "2017-12-05T08:55:36Z"},
{"review_id": "3052814050", "rating": 5, "title": "IphoneX", "review_date": "2018-08-12T06:12:08Z", "user_name": "I/love", "review": "Can’t do with out... the better feature is long term tracking"},
{"review_id": "3488722791", "rating": 3, "title": "Where's Brooklyn NY", "review_date": "2018-12-03T12:11:55Z", "user_name": "jasmartin2", "review": "often the air quality. in Brooklyn is different than other boroughs of NYC but this app only has one location for the city. (also its hard to switch from one place to another?)"},
{"review_id": "1945468463", "rating": 1, "title": "Used to be great", "review_date": "2017-11-24T15:14:16Z", "user_name": "Hacked Account", "review": "Why do I all of a sudden have to create an account to use this? Worked great until I updated, now you want to mine my data and save it in a database? To what end? Why weren’t my previous settings maintained as I updated? Think I’ll delete this.\n\nAlso, my user name is not “Hacked Account”. Not a bot - this is real feedback."},
{"review_id": "3078629996", "rating": 1, "title": "Does not provide accurate data", "review_date": "2018-08-17T19:08:46Z", "user_name": "SamStone1960", "review": "I’ve watched this app with increasing concern as the air here in Seattle has become the worst ever in our area due to this years wildfires. This app has consistently shown wildly incorrect data. I have a son with spastic quadriplegic cerebral palsy. Apps like this kill people like him. If you are health impaired or simply care about your health, DO NOT USE THIS APP.", "response_id": 4794504, "dev_response": "Hi there, thanks so much for your review and my sincere apologies that your experience with the app has not been up to scratch. I'd be more than happy to look into any perceived inconsistencies if you could please get in touch with support@plumelabs.com. Forecasting air pollution, especially due to extreme events such as wildfires, is a difficult and complex task. We are working hard to improve our forecasting methods but mistakes can still be made. We rely on our users to help us highlight any problems so we can address them as quickly as possible. Once again, I'm sorry that our app has not met your expectations, and I look forward to hearing more information from you to help us fix any possible problems. All best wishes, Joe for Plume.", "response_date": "2018-08-24T10:34:53Z"},
{"review_id": "4853490697", "rating": 1, "title": "Not accurate!!!", "review_date": "2019-09-28T14:54:37Z", "user_name": "Hddetgcsaoph", "review": "Do not trust this app it’s wildly inaccurate. When checking multiple other governmental sources and other apps for pollution, this app is the only one that falls very far off from the average. All the other sources will say the air is fresh and then plume is the only one that says the air pollution is high. Wrong, wrong wrong."},
{"review_id": "3228665908", "rating": 5, "title": "Awesome", "review_date": "2018-09-25T13:42:48Z", "user_name": "TGS Chaos", "review": "Not only does this app tell me how it is at this second, the app tells me how the air will be in the future"},
{"review_id": "1426676903", "rating": 5, "title": "Wonderful app", "review_date": "2016-08-04T18:55:29Z", "user_name": "Brio Boy", "review": "Best app to get accurate real-time information on air-quality."},
{"review_id": "2858187766", "rating": 4, "title": "Nice App", "review_date": "2018-07-07T17:18:11Z", "user_name": "What's the point of a nickname", "review": "Wish they allowed you to change 24 hour time to 12 hour time."},
{"review_id": "5155963285", "rating": 5, "title": "Refreshing", "review_date": "2019-11-17T05:31:36Z", "user_name": "Not So Fearless Reviewer", "review": "Always nice to know when it's safe to go outside."},
{"review_id": "5223823949", "rating": 5, "title": "Climate Change Is Here, Folks!", "review_date": "2019-12-02T06:44:26Z", "user_name": "AarCox2019", "review": "A great app and fun daily reminder of just how totally screwed we are."},
{"review_id": "3932267750", "rating": 1, "title": "app for your health", "review_date": "2019-03-27T09:12:05Z", "user_name": "hansemcito", "review": "i actually really like this app and will change this one star rating once plume can fix a serious problem. starting a few weeks ago, this app no longer reports accurate information. the data it gets is out of date and late gets updated. it lags far far behind real-time air quality posting. i can look in the sky here in seoul to easily confirm this. \nplume labs, please find out why this is happening and fix this. we need apps like this to protect our health!"},
{"review_id": "1508542873", "rating": 5, "title": "Visually Beautiful PLUS most informative", "review_date": "2016-12-25T06:47:59Z", "user_name": "HealthSeeker100", "review": "I love the daily moveable graph - presents information in a very clear and useful manner."},
{"review_id": "3426526460", "rating": 3, "title": "Great but poor world map", "review_date": "2018-11-17T03:17:34Z", "user_name": "mrbuffneff", "review": "Hard to see the country lines in the world map and it doesn’t have a “Where am I” button.  Always starts you in Europe."},
{"review_id": "3726110273", "rating": 1, "title": "Unreliable", "review_date": "2019-02-02T23:23:08Z", "user_name": "StefanR0", "review": "The scale of the AQI plot doesn't match with the AQI numbers, and the AQI numbers themselves are untrustworthy since they don't match with any other app's results. This app can't be used since one cannot trust the values displayed.\nBugs were reported to the developer a month ago, no update so far."},
{"review_id": "1552482348", "rating": 5, "title": "Great information", "review_date": "2017-02-25T18:32:59Z", "user_name": "Omar Jonguitud", "review": "Quite useful"},
{"review_id": "3948720181", "rating": 3, "title": "It was going great....", "review_date": "2019-03-31T00:21:33Z", "user_name": "ultimateroses", "review": "Then I woke up and opened my app, I can’t see any updates. The screen is just a blank blue. Please fix so I can get back to checking if I have to wear a face mask here in South Korea!"},
{"review_id": "5848237592", "rating": 3, "title": "miss world map", "review_date": "2020-04-22T13:40:15Z", "user_name": "LAMitchell9", "review": "The update changed the world map to a series of pinpoints, which does nothing to get an overall look at world air pollution.", "response_id": 14889894, "dev_response": "Hi,\n\nThanks for your feedback. Each pinpoint highlights a pollution street-level map accessible when you zoom in, or by clicking on the choose a city tab below the map. We are currently working on integrating the previous global World Air Map on the latest application.  Meanwhile you can still have access to it at the following address: https://air.plumelabs.com/en/\n\nPlease feel free to contact us at airreport@plumelabs.com, to share with us other feedback or comments.\n\nAll the best, Antoine Simon, Product Manager.", "response_date": "2020-04-24T12:17:44Z"},
{"review_id": "3087206309", "rating": 2, "title": "Unsure of their data source", "review_date": "2018-08-19T17:21:47Z", "user_name": "LiquideFeline", "review": "Multiple times the app has told me that air quality is decreasing or has decreased but the official airnow sensors have remained in the green. This app looks neat but doesn’t give reliable data.", "response_id": 4794467, "dev_response": "Hi there, thanks for your review! Would you please be able to contact support@plumelabs.com to let us know which city or cities you are referring to please? I'd be more than happy to follow up any concerns you may have with our air quality forecasting. Our team of atmospheric and data scientists is working hard to improve in-app forecasting, but any help our users can give us is always gratefully received. Thanks in advance! Joe for Plume.", "response_date": "2018-08-24T10:31:18Z"},
{"review_id": "1948976434", "rating": 3, "title": "Account needed", "review_date": "2017-11-26T00:36:03Z", "user_name": "squeebus", "review": "The latest version requires that you create an account.\nAnnoying"},
{"review_id": "1927929963", "rating": 5, "title": "So Helpful", "review_date": "2017-11-17T16:31:47Z", "user_name": "will728392", "review": "The morning pollution notification is fantastic! Can’t wait for Flow!"},
{"review_id": "3571760985", "rating": 5, "title": "Elegant interface", "review_date": "2018-12-25T15:43:22Z", "user_name": "dmatthies", "review": "Shows what is essential with zero clutter."},
{"review_id": "1926862865", "rating": 5, "title": "Wow, excellent, amazing", "review_date": "2017-11-17T06:05:01Z", "user_name": "Flanoos", "review": "- This is the first app that support Afghanistan.\n- It really support all the world.\n- pollution map is amazing.\n- no advertisement and still free?? are you kidding me.\n- already in low.\n- been waiting for this app all long time.\n- thanks, thanks, thanks"},
{"review_id": "2887695244", "rating": 2, "title": "Great app, but doesn’t work anymore for me", "review_date": "2018-07-11T23:16:02Z", "user_name": "Isopotonic", "review": "Can’t open it anymore, it keeps crashing upon opening. The daily AQI notification still works though, strangely."},
{"review_id": "3948393955", "rating": 1, "title": "Nothing works", "review_date": "2019-03-30T22:39:47Z", "user_name": "Agustín Lansot", "review": "It worked fine until today, when suddenly nothing works. No information is shown and I can’t even delete cities."},
{"review_id": "5766802204", "rating": 3, "title": "Not liking the update", "review_date": "2020-04-05T15:44:51Z", "user_name": "Sansan's Leelee", "review": "I prefer the older version. This version blows."},
{"review_id": "1459716406", "rating": 5, "title": "Useful", "review_date": "2016-10-02T14:03:50Z", "user_name": "HDBadBoy HR", "review": "Why wouldn't you want to know. I live in the Las Vegas valley area and polution is a growing concern."},
{"review_id": "3092416269", "rating": 1, "title": "Not accurate with other reliable sources", "review_date": "2018-08-20T22:34:18Z", "user_name": "qywieirbd", "review": "I checked this app against other reliable government sources and it was consistently inaccurate by large margins. The app functions great but is not a good source unfortunately.", "response_id": 4794451, "dev_response": "Hi there! Thanks so much for your review! I'd be grateful if you could reach out via email to support@plumelabs.com to let us know which city you are referring to. I'd be more than happy to look into any discrepancies if you provide me with some more information. Forecasting air quality is a difficult and complex task, and our team of data and atmospheric scientists are always working to improve our in-app readings. Any help you can give us to highlight these discrepancies is greatly appreciated. All the best, Joe for Plume.", "response_date": "2018-08-24T10:29:37Z"},
{"review_id": "5182439168", "rating": 5, "title": "Stay safe with Plume", "review_date": "2019-11-22T18:20:14Z", "user_name": "City Otter NYC", "review": "After"},
{"review_id": "5112757277", "rating": 5, "title": "Dam good", "review_date": "2019-11-09T17:44:26Z", "user_name": "gugvdjjb", "review": "Dam good system😊 \nMake it a bit simpler interface"},
{"review_id": "4401653992", "rating": 5, "title": "Love this App", "review_date": "2019-07-02T16:30:38Z", "user_name": "Carito Cf", "review": "Keeps me up to date with the AQI where ever I go."},
{"review_id": "1583762035", "rating": 5, "title": "Such great design", "review_date": "2017-04-08T11:56:41Z", "user_name": "GaetLePouet", "review": "Really love this app."},
{"review_id": "1994362354", "rating": 1, "title": "Can’t trust data", "review_date": "2017-12-14T00:09:36Z", "user_name": "Kate in Camarillo", "review": "The humidity is reported in the app at 46%, but the verified humidity is less than 10%. If this basic data is so far off, how can I possibly trust the other data?", "response_id": 2028098, "dev_response": "Hi there! Thanks so much for your feedback. I'd be more than happy to answer any questions you have about our data, and look into the humidity bug you described. Would you be able to let me know which city you are discussing by sending an email to support@plumelabs.com please? Thanks so much in advance. All best wishes, Joe for Plume.", "response_date": "2017-12-14T10:05:26Z"},
{"review_id": "2046084461", "rating": 2, "title": "Good but not great", "review_date": "2018-01-01T05:15:57Z", "user_name": "5 star = 250 coins?", "review": "It seems to work fine, but I can’t figure out how to add the locations I want to check easily. Sort of limits its usefulness!", "response_id": 2180788, "dev_response": "Hi there! Thanks so much for your review. To add a new city, simply tap the addition sign symbol in the top right of the \"Live & Forecast\" screen. Once you've selected the city you want, you can swipe left and right on the \"Live & Forecast\" screen to cycle between your favourite locations. Access the cities menu under \"Settings\" to delete any unwanted additions—just swipe on a city to remove it from the list. Many thanks again! Joe, for Plume.", "response_date": "2018-01-02T09:40:35Z"},
{"review_id": "5073209088", "rating": 1, "title": "Does not load", "review_date": "2019-11-02T19:16:21Z", "user_name": "theguywhowastedhistime", "review": "I don’t know why it doesn’t load. My fiancé and I have tried from both of our phones. No data. Just blank"},
{"review_id": "2152321701", "rating": 1, "title": "Totally disappointing", "review_date": "2018-02-01T06:04:32Z", "user_name": "Hamidjamali", "review": "I live in Tehran and the information given by this app in my area are totally inaccurate. I don’t recommend this app", "response_id": 2470541, "dev_response": "Hi there! Thanks for your review, it's so important to us to get feedback from our users! I'd be grateful if you could provide me with some more information about the situation you describe. Would you be able to email support@plumelabs.com with a screencap of the data in question? I'd be happy to forward this on to our data team and help ease any worries you have. Looking forward to your email! All best wishes, Joe for Plume.", "response_date": "2018-02-01T17:13:41Z"},
{"review_id": "4960755223", "rating": 2, "title": "Air quality", "review_date": "2019-10-17T14:14:35Z", "user_name": "kirongo", "review": "Here in thermal, California, there’s a lot of smoke.  One can hardly breathe and your app says it’s ok to go biking.  Give me a break!!!"},
{"review_id": "1967205285", "rating": 1, "title": "Slow", "review_date": "2017-12-03T12:02:33Z", "user_name": "WWest1974", "review": "The latest update has basically rendered my app useless. Waaaay to slow to use now. Update pls?", "response_id": 1917145, "dev_response": "Hi there! Thanks so much for your review and your feedback. Would you please be able to send through a little more information about the specific problems you are experiencing? If you send me an email including the model of your iPhone and your version of iOS, I'll discuss this with the dev team and get back to you asap. I'm reachable at team@plumelabs.com. Thanks again! Joe, for Plume Labs.", "response_date": "2017-12-04T11:23:46Z"},
{"review_id": "3460232126", "rating": 5, "title": "Great in every aspects", "review_date": "2018-11-25T21:22:26Z", "user_name": "GThabot", "review": "Great app!"},
{"review_id": "5754408606", "rating": 4, "title": "loved the app before not the update", "review_date": "2020-04-03T05:57:44Z", "user_name": "Lovelytissues", "review": "i loved the app and the cloud face indication but the update now is just not inviting and comfortable as before"},
{"review_id": "1610901992", "rating": 5, "title": "Great app!", "review_date": "2017-05-11T09:10:39Z", "user_name": "hjhjsj", "review": "Very useful!"},
{"review_id": "3398622062", "rating": 5, "title": "Breeze", "review_date": "2018-11-09T15:27:44Z", "user_name": "JavierCat", "review": "Yes!! I am wearing a mask"},
{"review_id": "5457486644", "rating": 1, "title": "Not accurate at all.", "review_date": "2020-01-28T06:37:23Z", "user_name": "9Mit", "review": "Mumbai pollution is way above than what is shown on this app."},
{"review_id": "3131412257", "rating": 1, "title": "Lousy app", "review_date": "2018-08-30T04:20:58Z", "user_name": "675239986", "review": "Don't waste your time with this inaccurate app"},
{"review_id": "3410487864", "rating": 1, "title": "Does not match official AQI", "review_date": "2018-11-12T17:23:37Z", "user_name": "the ayatolla of rock and rolla", "review": "This app does not match the official AQI . It is always off by quite a few points"},
{"review_id": "1517383848", "rating": 5, "title": "Great", "review_date": "2017-01-07T20:44:13Z", "user_name": "Ronald-roz", "review": "Love it"},
{"review_id": "5075859025", "rating": 1, "title": "Makes no sense", "review_date": "2019-11-03T02:56:44Z", "user_name": "gavin newsome", "review": "This app is egregiously wrong \nDeleting it"},
{"review_id": "1326349094", "rating": 5, "title": "Great app", "review_date": "2016-02-02T02:10:06Z", "user_name": "Just336674", "review": "Great app with a simple and friendly user interface. Has PM2.5 now with recent update, however it would be nice to see and graph every parameter at each station. You also can't see CO in the current day view, but you can see it in the week view (bug?).\n\nEven if it has its issues, I can tell this is a very active developer, and I wouldn't be surprised if this becomes the best and most simple to use pollution forecasting app. I see this app as becoming the Dark Sky of pollution forecasting.\n\nIf you want power user features while sacrificing user interface, there are apps that can give you more data and access to specific stations."},
{"review_id": "1259952068", "rating": 5, "title": "Awesome — improves health!", "review_date": "2015-09-20T01:11:11Z", "user_name": "From Soma to Soho", "review": "Works great! I rely on this beautifully-designed app and its notifications everyday: when pollution peaks, I avoid biking to work or dining on a terrace. I've always been conscious about my health (good diet, exercise, check-ups) but never thought about the respiratory dangers of urban air pollution until I discovered this app. Now I know. My lungs thank you!"},
{"review_id": "1274705261", "rating": 3, "title": "No pm2.5 number", "review_date": "2015-10-21T00:05:22Z", "user_name": "Aeolian.Mode", "review": "Good interface; clean, easy to read for me, simple and just good looking. It's a shame though because there isn't a pm2.5 number, which makes this app good only for the layperson. What does, and I quote from the app, \"the temperature of your city's air pollution\" even mean? Just display the air quality in the official scientific number, the pm2.5 number. Don't try to reinvent it. Tell me that today in Beijing it is 122 pm2.5 and that this is high; don't tell me that the plume index is 91."},
{"review_id": "1200599044", "rating": 5, "title": "Great app for those who like to breathe clean air", "review_date": "2015-05-21T15:37:44Z", "user_name": "SpyAnt007", "review": "So far I’ve used this app both in LA and Paris. It’s interesting to see how the pollution changes over the course of the day, and since I  can either walk or bike to work (in Paris), I can decide which is better for my lungs depending on the pollution level."},
{"review_id": "1391667095", "rating": 5, "title": "THE BEST.  PM 2.5 included.", "review_date": "2016-06-09T18:32:00Z", "user_name": "Mercedes2u", "review": "I love this app. if you are like me -concerned about your health and the quality of air you breathe throughout the day.... this app is for you. The app sends me daily notifications morning and evening on all categories when safe to be outdoors breathing in healthy air -in your area. 💚"},
{"review_id": "1316533828", "rating": 4, "title": "Great App when It Worked", "review_date": "2016-01-14T23:58:49Z", "user_name": "rkkuhn", "review": "This app has Houston listed as a city. When I first downloaded it, it worked great. Clean, simple, and nice to use. Sadly all I get now is a messaging stating \"no current data at this time.\" I do hope they are able to fix this soon. I really enjoyed the app and would like to use it again."},
{"review_id": "1362293074", "rating": 5, "title": "Makes the invisible (pollution) visible", "review_date": "2016-04-12T07:30:50Z", "user_name": "Realetime", "review": "Plume puts a number on some of the primary air pollutants affecting our health. Seeing this data everyday,  illuminates the fossil fuel problem and how it directly affects us. We need more apps like this to motivate people to fix the problem."},
{"review_id": "1309623514", "rating": 5, "title": "Nice job collecting & presenting this data", "review_date": "2016-01-01T17:50:07Z", "user_name": "DC-CA", "review": "Well done. I can't believe you are getting some bad reviews for missing cities - it's amazing you have pulled together all of the data from those different sources."},
{"review_id": "1358649687", "rating": 5, "title": "You can't fix a problem until you acknowledge its existence.", "review_date": "2016-04-05T00:04:09Z", "user_name": "Patrick McMillan", "review": "This app is a daily reminder that pollution is the number one crisis in the world today. Let's fix it. Ban the fossils!"},
{"review_id": "1331410643", "rating": 5, "title": "Great app", "review_date": "2016-02-11T17:09:00Z", "user_name": "Terming", "review": "I have chronic asthma but I am also a exercise fanatic so knowing when I can and should run is crucial. This app has been very accurate in helping me manage my activities!"},
{"review_id": "1241158028", "rating": 4, "title": "Very beautifully designed and useful", "review_date": "2015-08-11T01:10:36Z", "user_name": "daschles", "review": "My only complaint is that the apps standardized index for pollution doesn't match up easily with measures other forecasters use. But as long as you are willing to use its measure, it is a great design and useful tool"},
{"review_id": "1203195315", "rating": 3, "title": "Love it, but...", "review_date": "2015-05-27T04:43:29Z", "user_name": "Nightpast", "review": "It is amazing! Guys I really want to thank you for what you have done! And it's and awesome idea! \nMy only huge problems, is that I recently moved to another country for a couple of years, and you don't have it :(\nIt is the capital of Chile, Santiago, and it is so polluted. I just really wished you could add it! Please!"},
{"review_id": "1338523087", "rating": 4, "title": "Info Three Days Old", "review_date": "2016-02-25T16:01:17Z", "user_name": "JF212567", "review": "Interface is great but the app is always displaying info from three days ago. Not sure what the issue is. I have spent time trying to fix it to no avail."},
{"review_id": "1259768672", "rating": 5, "title": "Fantastic app for parents, runners and bikers", "review_date": "2015-09-19T15:44:33Z", "user_name": "Parentinboston", "review": "Lets you decide when to exercise, run, bike or take your kids outside based on pollution -- both current and forecast!"},
{"review_id": "1316033723", "rating": 4, "title": "Where's the pm2.5 number?", "review_date": "2016-01-13T23:13:12Z", "user_name": "Yowzoe", "review": "A very good start, but compromised by not having the *option* of looking at pollution indices using the standard ways it is measured worldwide. \n\nThis is a frustrating missing data point (perhaps the devs felt they had to \"make it accessible\" (dumb it down)?\n\nOptions are always good – please step it up and add indices like the pm2.5 (particulate matter) number, at least as a user *option*.\n\nAn otherwise beautifully produced app."},
{"review_id": "1265883396", "rating": 5, "title": "Ready to use and understand", "review_date": "2015-10-02T15:43:38Z", "user_name": "Rocketgurl", "review": "I love that I can choose my favorite activity and at a glance see if I should go out or not."},
{"review_id": "1374054911", "rating": 5, "title": "Eye opening", "review_date": "2016-05-05T23:09:21Z", "user_name": "RageRunner244", "review": "Great little app to show you daily air pollution levels. Had no idea how bad the air was until I opened the app."},
{"review_id": "1264412663", "rating": 1, "title": "Inaccurate", "review_date": "2015-09-29T11:40:32Z", "user_name": "Wash DC20009", "review": "This App does not have good data and is inaccurate. I live in DC and downloaded this App a week ago. In that time, this App has told me that DC's particulate pollution is at the very highest levels at times (above 300 or above 600, for example). Other times, it tells me DC's pollution is zero particles. The bottom line is that it's not a reliable App and has inaccurate data underlying its results."},
{"review_id": "1259103955", "rating": 5, "title": "Useful information on pollution", "review_date": "2015-09-18T08:16:17Z", "user_name": "LemonsAndIce", "review": "Great app! Had to kill and relaunch the app at start, but now it works flawlessly."},
{"review_id": "1258821573", "rating": 1, "title": "Doesn't work", "review_date": "2015-09-17T17:20:48Z", "user_name": "amadigan", "review": "First it asked to display notifications, then it wanted Facebook access. When I refused that it made me select my city rather than detecting my location. Then it just froze on a screen that said \"Plume Labs Air Report San Francisco\".\n\nIt's either buggy or it's just intended to collect personal information. Uninstalling..."},
{"review_id": "1303080474", "rating": 4, "title": "Really good app but the UI leaves something to be desired", "review_date": "2015-12-19T22:16:12Z", "user_name": "Absolutjct", "review": "App looks good and has great functionality but some good data is hidden and annoying to get to."},
{"review_id": "1295790068", "rating": 3, "title": "Still has bugs, needs more cities", "review_date": "2015-12-04T17:22:25Z", "user_name": "Back in the MSSR", "review": "Good UI, but some buggy navigation, and lack of cities listings. There are no Ohio cities for instance,  even though Cincinnati and Cleveland areas weigh in as top 10 year round particle pollution in America."},
{"review_id": "1381405290", "rating": 5, "title": "Your environment at a glance!", "review_date": "2016-05-20T12:40:12Z", "user_name": "Sparky Lisle", "review": "Set your activity level and know your current environmental risk from a PRO.\nSimply a great APP!\n\n- Air Permit Engineer"},
{"review_id": "1274953763", "rating": 5, "title": "Great app", "review_date": "2015-10-21T13:26:02Z", "user_name": "DAS50", "review": "But with room to further improve it.   Very much helps with awareness of how bad the air is you breath."},
{"review_id": "1336797606", "rating": 5, "title": "Works well, looks nice", "review_date": "2016-02-22T03:43:24Z", "user_name": "Glnicole", "review": "Does what it claims to do, and does it well."},
{"review_id": "1266977312", "rating": 3, "title": "Nice app weird numbers", "review_date": "2015-10-04T18:08:04Z", "user_name": "Gregos Angeles", "review": "Great app but the measures have changed since the launch. Very confusing to know the right pollution levels for Los Angeles."},
{"review_id": "1342211727", "rating": 5, "title": "Excellent app", "review_date": "2016-03-03T21:03:15Z", "user_name": "LAxBULLET", "review": "Cool features and is entertaining on its own."},
{"review_id": "1258985406", "rating": 1, "title": "Unrealiable", "review_date": "2015-09-18T02:00:52Z", "user_name": "Asthma bro", "review": "Downloaded this app to help with my asthma. First it took forever to load and was a hassle to find my city. The interface wasn't clear and I had no idea what the different faces meant beyond a general description."},
{"review_id": "1282718171", "rating": 1, "title": "Zero data for Austin? really?", "review_date": "2015-11-06T12:44:36Z", "user_name": "Shaktiboi", "review": "Looks like a nice interface but says \"no recent data\". For Austin, TX, the live allergy capital of the world? I don't think so; Austinites are obsessed with pollen and mold counts, which are available year round through other sources."},
{"review_id": "1259317053", "rating": 5, "title": "Great app", "review_date": "2015-09-18T17:39:33Z", "user_name": "Mitch295", "review": "Love it!"},
{"review_id": "1258985173", "rating": 1, "title": "Not good.", "review_date": "2015-09-18T02:00:12Z", "user_name": "GreenFreak1994", "review": "Poor USer experience and USer interface. Not really informational or good. Time spent downloading this app would be better spent going online and looking at your local news app."},
{"review_id": "1272727683", "rating": 3, "title": "Poor App Contrast", "review_date": "2015-10-16T22:31:44Z", "user_name": "0044512", "review": "It's difficult to see the text on screen due to the grey brown color or bright blue."},
{"review_id": "1300341171", "rating": 3, "title": "Austin??", "review_date": "2015-12-14T04:58:57Z", "user_name": "tomturbo2000", "review": "Austin is listed as a city but no report :("},
{"review_id": "1576466746", "rating": 5, "title": "Muy útil", "review_date": "2017-03-30T16:46:55Z", "user_name": "Cadavis94", "review": "Siempre quise un app que brinde información sobre la contaminación de mi ciudad."},
{"review_id": "4558679407", "rating": 5, "title": "Mrs M", "review_date": "2019-08-03T01:21:50Z", "user_name": "Mrs.M5119", "review": "FLOW personal portable air quality sensor is the best investment I have ever made! I have been enlightened and educated, and now realize that I have been poisoned my entire life by pollution by my geographical location. FLOW has helped me to make a life changing decision.. It's time to move.. Many thanks to Mr.Lancome and his team at Plume Labs. I also hope my health will improve :)"},
{"review_id": "1311927439", "rating": 5, "title": "NO TE ASFIXIES!", "review_date": "2016-01-06T02:36:47Z", "user_name": "«OpuS»", "review": "Excelente App para aminorar los posibles efectos dañinos de la contaminación ambiental sobre nuestro organismo. \nNo esperes a que los \"medios\" te digan cómo ESTUVO el índice: chécalo al momento en REAL TIME."},
{"review_id": "3522764990", "rating": 3, "title": "Could be great...", "review_date": "2018-12-12T14:20:12Z", "user_name": "capitanpano", "review": "IPhone app works good, except that if you take a look in future time and then want to refresh the app to the time you are in you need to force quit the app and open it again.\n\nThen there is the problem with the Apple Watch app... At least used to kind of work before and get some information from the iPhone app, although it never actually worked while I was exercising on LTE data by its own. And now it just simply says that I have to sign in on my iPhone where I'm already signed in.\n\nAnd then there is the Flow product that I would love to buy and contribute to the cause but they don't send it to Mexico."},
{"review_id": "3508383051", "rating": 2, "title": "Daily numbers bear no resemblance to other services or even EPA", "review_date": "2018-12-08T16:21:43Z", "user_name": "swyost", "review": "I can certainly see the merits of the app but at least where I live there are better options. In El Paso the daily numbers are grossly inaccurate compared to every other service. They all cluster within the same range and Plume is laughably higher.  They are so far off, you would think Plume set up air quality monitoring equipment on Interstate 10 at rush-hour or at the bottom of an active gravel pit.Today would be a good example. Having checked various apps and services and EPA data, air quality in the vicinity is moderate to good. According to Plume, it is very poor. Either everyone else is wrong (including my view out the window) or Plume needs to take a close look at its data sources."},
{"review_id": "3433853283", "rating": 1, "title": "AQI is regularly wrong", "review_date": "2018-11-18T23:40:23Z", "user_name": "TER00000", "review": "The AQI is consistently reading 50-100 points below other apps/sites. The app says it’s ok to bike and eat outside even though there is visible smoke in the air and other sites are reading 150+ AQI for particles."},
{"review_id": "3065481891", "rating": 2, "title": "Inaccurate??", "review_date": "2018-08-15T01:42:35Z", "user_name": "jennirmklee", "review": "The app isn’t reporting the same stats as the online version of Plume. The app states an AQI of 48, while the website indicates very high pollution with an AQI of 126. Also, airnow.gov shows 171. All PM2.5 numbers. Based on this, the app is not at all useful. \nThe interface is beautiful and intuitive, so there is potential."},
{"review_id": "1456495162", "rating": 3, "title": "A lot to like - but needs some polishing", "review_date": "2016-09-27T03:55:13Z", "user_name": "Schupman", "review": "Plume is a great resource to have (I live in Singapore where the air quality at times becomes miserable). But the data regularly cuts out - in the sense that the app does not receive new data and instead graphs a horizontal dotted line. In such cases, I go online to singapores haze.gov.sg site to get the data (where it is all regularly published). I'd rather not have to open a second app (my browser) to get this information. This should be fixed. The data is accessible enough."},
{"review_id": "1362931952", "rating": 2, "title": "Bof", "review_date": "2016-04-13T14:44:38Z", "user_name": "Jlex78", "review": "Look assez vieux. Appli pas tres innovante et utile"},
{"review_id": "1305044767", "rating": 2, "title": "Austin TX is still not working...\"No recent data available\"", "review_date": "2015-12-23T17:11:29Z", "user_name": "Sionnachfox", "review": "Update (2015/12/22)\nLooks like Austin has been restored again and is now working.\n\nHopefully this will continue to work without issues in the future\n\n----------\nAgain Austin TX is still not working for this app ? Why not guys ?\n\n----------\n\nWhen I first bought the app it was giving \"apparent\" accurate readings for Austin TX.\n\nThen the daily push alerts started to give wildly inaccurate numbers (way high).\nWhen you look at the app it now says \"no recent data available\" for Austin.\nThis city was available before and now it is gone ?\n\nWhat's going on guys ?"}
]